app/controllers/workers_controller.rb

  def index
    @workers = Worker.all
---
SELECT "workers".* FROM "workers"

  def create
    @worker = Worker.new(worker_params)

    respond_to do |format|
      if @worker.save
---
INSERT INTO "workers" ("nombre", "rut", "direccion", "telefono", "mail", "equipo", "jefe", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_worker
      @worker = Worker.find(params[:id])
---
SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]